import React from 'react';


const Bolg = () => {
    return (
        <div className='text-center ms-5 me-5 mt-5'>
            <h4> Difference between authorization and authentication?</h4>
            <p>
                সহজভাবে বলতে গেলে, প্রমাণীকরণ হল কেউ কে তা যাচাই করার প্রক্রিয়া, যেখানে অনুমোদন হল ব্যবহারকারীর কোন নির্দিষ্ট অ্যাপ্লিকেশন, ফাইল এবং ডেটাতে অ্যাক্সেস রয়েছে তা যাচাই করার প্রক্রিয়া। পরিস্থিতি এমন একটি এয়ারলাইনের মতো যা নির্ধারণ করতে হবে কোন লোক বোর্ডে আসতে পারে।প্রমাণীকরণ এবং অনুমোদন এলাকা ইউনিট উভয়ই জ্ঞান সুরক্ষার ক্ষেত্রে ব্যবহৃত হয় যা একটি স্বয়ংক্রিয় ডেটা সিস্টেমে সুরক্ষার অনুমতি দেয়। প্রতিটি এলাকা ইউনিট ভয়ঙ্করভাবে গুরুত্বপূর্ণ বিষয় সাধারণত অনলাইনে তার পরিষেবা পরিকাঠামোর মূল আইটেম হিসাবে সম্পর্কিত। যাইহোক, প্রতিটি পদ এলাকা ইউনিট সম্পূর্ণ ভিন্ন ধারণা সঙ্গে ভয়ঙ্করভাবে সম্পূর্ণ ভিন্ন. যদিও এটি সত্য যে তারা সাধারণত একটি সমতুল্য সরঞ্জামের সাথে একটি সমতুল্য প্রসঙ্গে নিযুক্ত করা হয়, তারা একে অপরের থেকে সম্পূর্ণ আলাদা।</p>
            <h4>Why are you using firebase? What other options do you have to implement authentication?</h4>
            <p>ফায়ারবেস রিয়েলটাইম ডেটাবেস আপনাকে সরাসরি ক্লায়েন্ট-সাইড কোড থেকে ডাটাবেসে নিরাপদ অ্যাক্সেসের অনুমতি দিয়ে সমৃদ্ধ, সহযোগী অ্যাপ্লিকেশন তৈরি করতে দেয়। ডেটা স্থানীয়ভাবে বজায় থাকে, এবং অফলাইনে থাকাকালীনও, রিয়েলটাইম ইভেন্টগুলি অব্যাহত থাকে, শেষ ব্যবহারকারীকে একটি প্রতিক্রিয়াশীল অভিজ্ঞতা দেয়। <br />
                সাধারণত, একটি সার্ভার দ্বারা প্রমাণীকরণ একটি ব্যবহারকারীর নাম এবং পাসওয়ার্ড ব্যবহার entails. প্রমাণীকরণের অন্যান্য উপায়গুলি কার্ড, রেটিনা স্ক্যান, ভয়েস রিকগনিশন এবং আঙ্গুলের ছাপের মাধ্যমে হতে পারে।</p>
            <h4>What other services does firebase provide other than authentication?</h4>
            <p>
                Firebase প্রমাণীকরণ ব্যাকএন্ড পরিষেবা, সহজে ব্যবহারযোগ্য SDK এবং আপনার অ্যাপে ব্যবহারকারীদের প্রমাণীকরণের জন্য তৈরি UI লাইব্রেরি প্রদান করেFirebase Auth বিকল্প
                ফায়ারবেস বিকল্প - শীর্ষ 10+ প্রতিযোগী</p>




        </div>
    );
};

export default Bolg;